
zoo_dict = {1: {"Пингвин Гумбольдта"},
            2: {"Казуар"},
            3: {"Орлиный попугай", "Сливоголовый попугай"},
            4: {"Красноглазая квакша", "Дальневосточная квакша", "Жаба-ага"},
            5: {"Пума"},
            6: {"Леопард", "Рысь", "Леопард дымчатый"},
            7: {"Дальневосточный леопард"},
            8: {"Лесной северный олень"},
            9: {"Волк"},
            10: {"Лесной кот", "Неясыть", "Гривистый волк", "Полярный волк"},
            11: {"Рысь"},
            12: {"Равниный тапир"},
            13:{"Орлан"},
            14:{"Гималайский медведь"},
            15:{"Малая панда"},
            16:{"Гималайский медведь"},
            17:{"Манул"},
            18:{"Беркут"},
            19: {"Большая панда"},
            20: {"Обыкновенная носуха"},
            21: {"Фламинго"},
            22: {"Красный волк"},
            23: {"Ушастая сова", "Неясыть", "Длиннохвостая неясыть", "Полярная сова"},
            24: {"Паук Блуждающий", "Паук-Серебрянка", "Паук-Аргиопа"}
            }

search_value = input(f'Введите животное для поиска: ')
neighbors = []

for i, value in zoo_dict.items():
    if search_value in value:
        neighbors = [zoo_dict.get(i-1), zoo_dict.get(i), zoo_dict.get(i+1)]
        break

print(neighbors)